CPSC3383/homework/Assignment2.tex
% Created 2020-01-30 Thu 10:17
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Denver Ellis | T00591699}
\date{\today}
\title{CPSC 3380: Operating Systems | Assignment 2}
\hypersetup{
 pdfauthor={Denver Ellis | T00591699},
 pdftitle={CPSC 3380: Operating Systems | Assignment 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Problem 1.1}
\label{sec:orgbef64ac}
\subsection{Question}
\label{sec:org1ca78ef}
What are the main purposes of an operating system?
\subsection{Answer}
\label{sec:org3591374}
\section{Problem 1.6}
\label{sec:org469fa11}
\subsection{Question}
\label{sec:org37de49c}
Consider the various definitions of operating system. Next, consider whether the operating system should include applications such as Web browsers and mail programs. Argue both that it should and that is should not, and support your answers.
\subsection{Answer}
\label{sec:org7c2c975}
\section{Problem 1.7}
\label{sec:orgc2dbe7e}
\subsection{Question}
\label{sec:org31521cf}
How does the distinction between kernel mode and user mode function as a rudimentary form of protection (security) system?
\subsection{Answer}
\label{sec:org7ee6406}
\section{Problem 1.8}
\label{sec:org0dbd110}
\subsection{Question}
\label{sec:orgc516e04}
Which of the following instructions should be privileged?
\begin{enumerate}
\item Set value of timer
\item Read the clock
\item Clear memory
\item Issue a trap instruction
\item Turn off interrupts
\item Modify entries in device-status table
\item Switch from user to kernel mode
\item Access I/O devices
\end{enumerate}
\subsection{Answer}
\label{sec:org73a17d9}
\begin{enumerate}
\item[{$\boxtimes$}] Set value of timer
\item[{$\square$}] Read the clock
\item[{$\boxtimes$}] Clear memory
\item[{$\square$}] Issue a trap instruction
\item[{$\boxtimes$}] Turn off interrupts
\item[{$\square$}] Modify entries in device-status table
\item[{$\boxtimes$}] Switch from user to kernel mode
\item[{$\square$}] Access I/O devices
\end{enumerate}
\section{Problem 2.5}
\label{sec:org5272558}
\subsection{Question}
\label{sec:orgc1b4543}
What are the main purposes of an operating system?
\subsection{Answer}
\label{sec:orga581eea}
\section{Problem 2.9}
\label{sec:orgbdc945d}
\subsection{Question}
\label{sec:org0dfc117}
What are the main purposes of an operating system?
\subsection{Answer}
\label{sec:org264e1e8}
\section{Problem 2.1}
\label{sec:org57b5409}
\subsection{Question}
\label{sec:orgc3348c3}
What are the main purposes of an operating system?
\subsection{Answer}
\label{sec:org93268b4}
\section{Problem 2.7}
\label{sec:org6e4651d}
\subsection{Question}
\label{sec:org9943f31}
What are the main purposes of an operating system?
\subsection{Answer}
\label{sec:orgac227ea}
\section{Problem 2.8}
\label{sec:org8bd5ee2}
\subsection{Question}
\label{sec:orgb355acd}
What are the main purposes of an operating system?
\subsection{Answer}
\label{sec:org5466f12}
\section{Problem 2.10}
\label{sec:orgbe7d897}
\subsection{Question}
\label{sec:orge4ea3c4}
What are the main purposes of an operating system?
\subsection{Answer}
\label{sec:org32a5dd1}
\section{Question 3}
\label{sec:org83605f8}
\subsection{Question}
\label{sec:org8499227}
Describe the pros and cons of the micro kernel (MK) architecture of OS
\end{document}
